Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Prevents malicious scripts gaining access to your device to mine digital currency.
am: ተንኮል አዘል ስክሪፕቶች መሳሪያዎን ለዲጂታል ገንዘብ ቁፋሮ ለማዋል ፈቃድ እንዳያገኙ ይከላከላል።

source: Prevent this page from creating additional dialogs
am: ይህ ገጽ ተጨማሪ መገናኛዎችን እንዳይፈጥር ይከለክሉት

source: Price
am: ዋጋ

source: Pride
am: ኩራት

source: Print
am: አትም

source: Print…
am: አትም…

source: Privacy and security
am: ግላዊነት እና ደህንነት

source: Privacy and security settings
am: የግላዊነት እና የደህንነት ቅንብሮች

source: privacy notice
am: የግላዊነት ማስታወቂያ

source: Privacy notice
am: የግላዊነት ማሳወቂያ

source: Privacy Notice
am: የግላዊነት ማስታወቂያ

source: privacy policy
am: የግላዊነት ፖሊሲ

source: Privacy policy
am: የግላዊነት መምሪያ

source: Privacy protection by default
am: በነባሪ የግላዊነት ጥበቃ

source: Private
am: የግል

source: Private browsing
am: የግል አሰሳ

source: Private browsing data deleted
am: የግል አሰሳ ውሂብ ተሰርዟል

source: Private browsing in %1$s doesn’t save your info.
am: የግል አሰሳ በ%1$s ውስጥ መረጃዎን አያስቀምጥም።

source: Private browsing session
am: የግል የማሰሻ ክፍል

source: Private %s
am: የግል %s

source: Private Search
am: የግል ፍለጋ

source: Private tab closed
am: የግል ትር ተዘግቷል

source: Private tabs
am: የግል ትሮች

source: Private tabs closed
am: የግል ትሮች ተዘግተዋል

source: Private Tabs Open: %1$s. Tap to switch tabs.
am: የግል ትሮች ተከፍተዋል፡ %1$s። ትሮችን ለመቀየር መታ ያድርጉ።

source: Product is not available
am: ምርቱ አይገኝም

source: Protections are OFF for this site
am: ለዚህ ጣቢያ ጥበቃዎች ጠፍተዋል

source: Protections are OFF. We suggest turning them back on.
am: ጥበቃዎች ጠፍተዋል። እነሱን መልሰው እንዲያበሩዋቸው እንመክራለን።

source: Protections are ON for this site
am: ጥበቃዎች ለዚህ ጣቢያ በርተዋል

source: Protection Settings
am: የጥበቃ ቅንብሮች

source: Protect your account by using a strong, randomly generated password. It’ll be saved into your account for future use.
am: ጠንካራ በዘፈቀደ የመነጨ የይለፍ ቃል በመጠቀም መለያዎን ይጠብቁ። ለወደፊት ጥቅም በመለያዎ ውስጥ ይቀመጣል።

source: Protect your accounts by using a strong, randomly generated password. Get quick access to your passwords by saving it in your account.
am: ጠንካራ በዘፈቀደ የመነጨ የይለፍ ቃል በመጠቀም መለያዎችዎን ይጠብቁ። የይለፍ ቃላትዎን በመለያዎ ውስጥ በማስቀመጥ ፈጣን መዳረሻ ያግኙ።

source: Protect your accounts by using a strong, randomly generated password. It’ll be saved into your account for future use.
am: ጠንካራ በዘፈቀደ የመነጨ የይለፍ ቃል በመጠቀም መለያዎችዎን ይጠብቁ። ለወደፊት ጥቅም ወደ መለያዎ ይቀመጣል።

source: Provide cryptographic authentication services
am: ክሪፕቶግራፊክ የማረጋገጫ አገልግሎቶችን ያቅርቡ

source: Provider
am: አቅራቢ

source: Province
am: ዞን

source: Proxy Server Not Found
am: ተኪ አገልጋይ አልተገኘም

source: Proxy Server Refused Connection
am: ተኪ አገልጋይ ግንኙነትን ውድቅ አድርጓል

source: <p>The address specifies a protocol (e.g., <q>wxyz://</q>) the browser does not recognize, so the browser cannot properly connect to the site.</p> <ul> <li>Are you trying to access multimedia or other non-text services? Check the site for extra requirements.</li> <li>Some protocols may require third-party software or plugins before the browser can recognize them.</li> </ul>
am: <p>አድራሻው ፕሮቶኮልን ይገልጻል (ለምሳሌ <q>wxyz://</q>) አሳሹ ይህን ስለማያቀው በትክክል ከድረ-ገጹ ጋር መገናኘት አይችልም።</p> <ul> <li>መልቲሚዲያ ወይም ሌሎች የጽሑፍ ያልሆኑ አገልግሎቶችን ለማግኘት እየሞከሩ ነው? ለተጨማሪ መስፈርቶች ድረ-ገጹን ይፈትሹ።</li> <li>አንዳንድ ፕሮቶኮሎች በአሳሹ ከመታወቃቸው በፊት የሶስተኛ ወገን ሶፍትዌር ወይም ቅጥያዎችን ሊፈልጉ ይችላሉ።</li> </ul>

source: <p>The browser connected successfully, but the connection was interrupted while transferring information. Please try again.</p> <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
am: <p>አሳሹ በተሳካ ሁኔታ ተገናኝቷል፣ ነገር ግን መረጃ በሚተላለፍበት ጊዜ ግንኙነቱ ተቋርጧል። እባክዎ እንደገና ይሞክሩ።</p> <ul> <li>ድረ-ገጹ ለጊዜው የማይገኝ ወይም በጣም ስራ የበዛበት ሊሆን ይችላል። ከጥቂት ጊዜ በኋላ እንደገና ይሞክሩ።</li> <li>ምንም ገጾችን መጫን ካልቻሉ የመሣሪያዎን ውሂብ ወይም የWi-Fi ግንኙነት ያረጋግጡ።</li> </ul>

source: <p>The browser could not find the host server for the provided address.</p> <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
am: <p>አሳሹ ለተጠቀሰው አድራሻ አስተናጋጅ አገልጋይ ማግኘት አልቻለም።</p> <ul> <li>ለትየባ ስህተቶች አድራሻውን ያረጋግጡ ለምሣሌ <strong>ww</strong>.example.com በ<strong>www</strong>.example.com ምትክ።</li> <li>ምንም ገጾችን መጫን ካልቻሉ የመሣሪያዎን ውሂብ ወይም የWi-Fi ግንኙነት ያረጋግጡ።</li> </ul>

source: <p>The browser has stopped trying to retrieve the requested item. The site is redirecting the request in a way that will never complete.</p> <ul> <li>Have you disabled or blocked cookies required by this site?</li> <li>If accepting the site’s cookies does not resolve the problem, it is likely a server configuration issue and not your device.</li> </ul>
am: <p>አሳሹ የተጠየቀውን ንጥል ሰርስሮ ለማውጣት መሞከሩን አቁሟል። ድረ-ገጹ ጥያቄውን በማያጠናቅቅ መንገድ እየመራው ነው።</p> <ul> <li>በዚህ ድረ-ገጽ የሚፈለጉ ኩኪዎችን አሰናክለዋል ወይም አግደዋል?</li> <li>የድረ-ገጹን ኩኪዎች መቀበል ችግሩን ካልፈታው፣ ምናልባት የእርስዎ መሣሪያ ሳይሆን የአገልጋይ ውቅር ችግር ነው።</li> </ul>

source: <p>The browser is configured to use a proxy server, but the proxy could not be found.</p> <ul> <li>Is the browser’s proxy configuration correct? Check the settings and try again.</li> <li>Is the device connected to an active network?</li> <li>Still having trouble? Consult your network administrator or Internet provider for assistance.</li> </ul>
am: <p>አሳሹ ተኪ አገልጋይ እንዲጠቀም ተዋቅሯል፣ ነገር ግን ተኪው ሊገኝ አልቻለም።</p> <ul> <li>የአሳሹ ተኪ ውቅር ትክክል ነው? ቅንብሮቹን ይፈትሹ እና እንደገና ይሞክሩ።</li> <li>መሣሪያው ከገባሪ አውታረ መረብ ጋር የተገናኘ ነው?</li> <li>አሁንም ችግር አለ? ለእርዳታ የአውታረ መረብ አስተዳዳሪዎን ወይም የበይነመረብ አቅራቢዎን ያማክሩ።</li> </ul>

source: <p>The browser is configured to use a proxy server, but the proxy refused a connection.</p> <ul> <li>Is the browser’s proxy configuration correct? Check the settings and try again.</li> <li>Does the proxy service allow connections from this network?</li> <li>Still having trouble? Consult your network administrator or Internet provider for assistance.</li> </ul>
am: <p>አሳሹ ተኪ አገልጋይ እንዲጠቀም ተዋቅሯል፣ ነገር ግን ተኪው ግንኙነትን ውድቅ አደረገ።</p> <ul> <li>የአሳሹ ተኪ ውቅር ትክክል ነው? ቅንብሮቹን ይፈትሹ እና እንደገና ይሞክሩ።</li> <li>የተኪ አገልግሎቱ ከዚህ አውታረ መረብ ጋር መገናኘትን ይፈቅዳል?</li> <li>አሁንም ችግር አለ? ለእርዳታ የአውታረ መረብ አስተዳዳሪዎን ወይም የበይነመረብ አቅራቢዎን ያማክሩ።</li> </ul>

source: <p>The browser is operating in its offline mode and cannot connect to the requested item.</p> <ul> <li>Is the device connected to an active network?</li> <li>Press “Try Again” to switch to online mode and reload the page.</li> </ul>
am: <p>አሳሹ የሚሰራው ከመስመር ውጭ በሆነው ሁነታ ነው እና ከተጠየቀው ንጥል ጋር መገናኘት አይችልም።</p> <ul> <li>መሣሪያው ከገባሪ አውታረ መረብ ጋር የተገናኘ ነው?</li> <li>ወደ የመስመር ላይ ሁነታ ለመቀየር እና ገጹን እንደገና ለመጫን “እንደገና ሞክር”ን ይጫኑ።</li> </ul>

source: <p>The network link was interrupted while negotiating a connection. Please try again.</p> <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
am: <p>በግንኙነት ላይ ሲደራደሩ የአውታረ መረቡ ማገናኛ ተቋርጧል። እባክዎ እንደገና ይሞክሩ።</p> <ul> <li>ድረ-ገጹ ለጊዜው የማይገኝ ወይም በጣም ስራ የበዛበት ሊሆን ይችላል። ከጥቂት ጊዜ በኋላ እንደገና ይሞክሩ።</li> <li>ምንም ገጾችን መጫን ካልቻሉ የመሣሪያዎን ውሂብ ወይም የWi-Fi ግንኙነት ያረጋግጡ።</li> </ul>

source: <p>The page you are trying to view cannot be shown because an error in the data transmission was detected.</p> <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
am: <p>ለማየት እየሞከሩት ያለው ገጽ ሊታይ አይችልም ምክንያቱም በመረጃ ስርጭቱ ላይ ስህተት ስለተገኘ።</p> <ul> <li>እባክዎ ይህንን ችግር ለማሳወቅ የድረ-ገፁን ባለቤቶች ያነጋግሩ።</li> </ul>

source: <p>The page you are trying to view cannot be shown because it uses an invalid or unsupported form of compression.</p> <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
am: <p>ለማየት እየሞከሩት ያለው ገጽ ልክ ያልሆነ ወይም የማይደገፍ የማመቅ ዘዴ ስለሚጠቀም ሊታይ አይችልም።</p> <ul> <li>እባክዎ ይህንን ችግር ለማሳወቅ የድረ-ገፁን ባለቤቶች ያነጋግሩ።</li> </ul>

source: <p>The provided address is not in a recognized format. Please check the location bar for mistakes and try again.</p>
am: <p>የቀረበው አድራሻ በሚታወቅ ቅርጸት አይደለም። እባክዎ ለስህተቶች የአካባቢ አሞሌን ያረጋግጡ እና እንደገና ይሞክሩ።</p>

source: <p>The requested address specified a port (e.g., <q>mozilla.org:80</q> for port 80 on mozilla.org) normally used for purposes <em>other</em> than Web browsing. The browser has canceled the request for your protection and security.</p>
am: <p>የተጠየቀው አድራሻ ወደብ (ምሣ. <q>mozilla.org:80</q> በmozilla.org ላይ ወደብ 80) በተለምዶ ከድር አሰሳ ውጭ ለ<em>ሌላ</em> ጥቅም ላይ ይውላል። ለእርስዎ ጥበቃ እና ደህንነት አሳሹ ጥያቄውን ሰርዟል።</p>

source: <p>The requested site did not respond to a connection request and the browser has stopped waiting for a reply.</p> <ul> <li>Could the server be experiencing high demand or a temporary outage? Try again later.</li> <li>Are you unable to browse other sites? Check the device’s network connection.</li> <li>Is your device or network protected by a firewall or proxy? Incorrect settings can interfere with Web browsing.</li> <li>Still having trouble? Consult your network administrator or Internet provider for assistance.</li> </ul>
am: <p>የተጠየቀው ድረ-ገጽ ለግንኙነት ጥያቄ ምላሽ አልሰጠም እና አሳሹ ምላሽ መጠበቅ አቁሟል።</p> <ul> <li>አገልጋዩ ከፍተኛ ፍላጎት ወይም ጊዜያዊ መቋረጥ እያጋጠመው ሊሆን ይችላል? ቆይተው እንደገና ይሞክሩ።</li> <li>ሌሎች ድረ-ገጾችን ማሰስ አይችሉም? የመሳሪያውን የአውታረ መረብ ግንኙነት ይፈትሹ።</li> <li>የእርስዎ መሣሪያ ወይም አውታረ መረብ በፋየርዎል ወይም በፕሮክሲ የተጠበቀ ነው? ትክክል ያልሆኑ ቅንብሮች በድር አሰሳ ላይ ጣልቃ ሊገቡ ይችላሉ።</li> <li>አሁንም ችግር አለ? ለእርዳታ የአውታረ መረብ አስተዳዳሪዎን ወይም የበይነመረብ አቅራቢዎን ያማክሩ።</li> </ul>

source: <p>The site at %1$s has been reported as an attack site and has been blocked based on your security preferences.</p>
am: <p>በ%1$s ያለው ድረ-ገፅ የጥቃት ድረ-ገፅ ተብሎ ሪፖርት ተደርጓል እና በእርስዎ የደህንነት ምርጫዎች መሠረት ታግዷል።</p>

source: <p>The site at %1$s has been reported as a potentially harmful site and has been blocked based on your security preferences.</p>
am: <p>በ%1$s ያለው ድረ-ገፅ ጎጂ ሊሆን የሚችል ድረ-ገፅ ተብሎ ሪፖርት ተደርጓል እና በእርስዎ የደህንነት ምርጫዎች መሠረት ታግዷል።</p>

source: <p>The site at %1$s has been reported as serving unwanted software and has been blocked based on your security preferences.</p>
am: <p>በ%1$s ያለው ድረ-ገጽ ያልተፈለገ ሶፍትዌር እንደሚያቀርብ ሪፖርት ተደርጓል እና በእርስዎ የደህንነት ምርጫዎች መሰረት ታግዷል።</p>

source: <p>The site responded to the network request in an unexpected way and the browser cannot continue.</p>
am: <p>ድረ-ገፁ ለኔትወርክ ጥያቄው ባልተጠበቀ መልኩ ምላሽ ሰጥቷል እና አሳሹ መቀጠል አልቻለም።</p>

source: <p>This web page at %1$s has been reported as a deceptive site and has been blocked based on your security preferences.</p>
am: <p>ይህ በ%1$s ላይ ያለው ድረ-ገጽ እንደ አታላይ ድረ-ገጽ ሪፖርት ተደርጓል እና በእርስዎ የደህንነት ምርጫዎች መሠረት ታግዷል።</p>

source: Pull to refresh
am: ለማደስ ይጎትቱ

source: Purple
am: ሐምራዊ

source: QR scanner
am: የQR ስካነር

source: Quality
am: ጥራት

source: Quick settings sheet
am: ፈጣን ቅንብሮች ገፅ

source: Quit
am: አቁም

source: Quit %1$s
am: %1$s አቋርጥ

source: Quitting the application to apply changes…
am: ለውጦችን ለመተግበር መተግበሪያውን በማቆም ላይ…

source: Rated %1$s out of 5
am: ከ5 %1$s ደረጃ ተሰጥቶታል

source: Rate on Google Play
am: Google Play ላይ ደረጃ ይስጡ

source: Rating
am: ደረጃ

source: Rating: %1$.02f out of 5
am: ደረጃ፡ %1$.02f ከ 5

source: Read and change website data
am: የድር ጣቢያ ውሂብ ያንብቡ እና ይቀይሩ

source: Read and modify bookmarks
am: ዕልባቶችን ያንብቡ እና ይቀይሩ

source: Read and modify browser settings
am: የአሳሽ ቅንብሮችን ያንብቡ እና ይቀይሩ

source: Read and modify privacy settings
am: የግላዊነት ቅንብሮችን ያንብቡ እና ይቀይሩ

source: Reader view
am: የአንባቢ እይታ

source: Reader View, Print, Share, Open app
am: የአንባቢ እይታ፣ ማተም፣ አጋራ፣ መተግበሪያ ከፋች

source: Reader View, Report broken site, Print, Share, Open app
am: የአንባቢ እይታ፣ የተበላሸ ጣቢያን ሪፖርት አድርግ፣ አትም፣ አጋራ፣ መተግበሪያን ክፈት

source: Reader View, %s, Print, Share, Open app
am: የአንባቢ እይታ፣ %s፣ አትም፣ አጋራ፣ መተግበሪያን ክፈት

source: Reader View, Translate, Print, Share, Open app
am: የአንባቢ እይታ፣ ትርጉም፣ ማተም፣ አጋራ፣ መተግበሪያ ከፋች

source: Reader View, Translate, Report broken site, Print, Share, Open app
am: የአንባቢ እይታ፣ ተርጉም፣ የተበላሸ ጣቢያን ሪፖርት አድርግ፣ አትም፣ አጋራ፣ መተግበሪያን ክፈት

source: Reader View, Translate, %s, Print, Share, Open app
am: የአንባቢ እይታ፣ ተርጉም፣ %s፣ አትም፣ አጋራ፣ መተግበሪያን ክፈት

source: Read our privacy notice
am: የእኛን የግላዊነት መመሪያ ያንብቡ

source: read the article
am: ጽሑፉን ያንብቡ

source: Read the text of all open tabs
am: የሁሉም ክፍት ትሮች ጽሑፍ ያንብቡ

source: Read your browsing history
am: የአሰሳ ታሪክዎን ያንብቡ

source: Ready to open up an amazing internet?
am: የሚገርም ኢንተርኔት ለመክፈት ዝግጁ ነዎት?

source: Ready to scan
am: ለመቃኘት ዝግጁ

source: Rear-facing camera
am: የኋላ ካሜራ

source: Received tabs
am: የተቀበሉት ትሮች

source: Recent bookmarks
am: የቅርብ ጊዜ እልባቶች

source: Recently closed
am: በቅርብ ጊዜ የተዘጉ

source: Recently closed tabs
am: በቅርብ ጊዜ የተዘጉ ትሮች

source: Recently saved
am: በቅርቡ የተቀመጠ

source: Recently used
am: በቅርብ ጊዜ ጥቅም ላይ የዋለ

source: Recently visited
am: በቅርብ ጊዜ የተጎበኙ

source: Recent Searches
am: የቅርብ ጊዜ ፍለጋዎች

source: Recommended
am: የሚመከር

source: Recommended extensions
am: የሚመከሩ ቅጥያዎች

source: Reconnect to resume syncing
am: ማመሳሰልን ለመቀጠል እንደገና ይገናኙ

source: Reconnect to Sync
am: ከማመሳሰል ጋር እንደገና ያገናኙ

source: Red
am: ቀይ

source: Redirect Trackers
am: የዝውውር መከታተያዎች

source: Reduce cookie banners
am: የኩኪ ሰሌዳዎችን ይቀንሱ

source: Refreshing this page could duplicate recent actions, such as sending a payment or posting a comment twice.
am: ይህን ገጽ ማደስ እንደ ክፍያ መላክ ወይም አስተያየት መለጠፍ ያሉ የቅርብ ጊዜ ድርጊቶችን ሁለት ጊዜ ማባዛት ይችላል።

source: Reliable reviews
am: አስተማማኝ ግምገማዎች

source: Reliable reviews. We believe the reviews are likely from real customers who left honest, unbiased reviews.
am: አስተማማኝ ግምገማዎች። ግምገማዎቹ ሐቀኛ፣ አድልዎ የለሽ ግምገማዎችን ትተው ከወጡ እውነተኛ ደንበኞች ሊሆኑ እንደሚችሉ እናምናለን።

source: Reload
am: እንደገና ጫን

source: Remember decision for this site
am: የዚህን ድረ-ገፅ ውሳኔ አስታውስ

source: Reminder: %1$s is still using your camera. Tap to open the tab.
am: ማስታወሻ፦ %1$s አሁንም ካሜራዎን እየተጠቀመ ነው። ትሩን ለመክፈት መታ ያድርጉ።

source: Reminder: %1$s is still using your microphone and camera. Tap to open the tab
am: ማስታወሻ፦ %1$s አሁንም የእርስዎን ማይክሮፎን እና ካሜራ እየተጠቀመ ነው። ትሩን ለመክፈት መታ ያድርጉ

source: Reminder: %1$s is still using your microphone and camera. Tap to open the tab.
am: ማስታወሻ፦ %1$s አሁንም የእርስዎን ማይክሮፎን እና ካሜራ እየተጠቀመ ነው። ትሩን ለመክፈት መታ ያድርጉ።

source: Reminder: %1$s is still using your microphone. Tap to open the tab
am: ማስታወሻ፦ %1$s አሁንም ማይክሮፎንዎን እየተጠቀመ ነው። ትሩን ለመክፈት መታ ያድርጉ

source: Reminder: %1$s is still using your microphone. Tap to open the tab.
am: ማስታወሻ፦ %1$s አሁንም የእርስዎን ማይክሮፎን እየተጠቀመ ነው። ትሩን ለመክፈት መታ ያድርጉ።

source: Remote debugging via USB
am: በUSB የርቀት ማረም

source: Remove %1$s
am: %1$sን አስወግድ

source: Remove account
am: መለያ አስወግድ

source: Remove all exceptions
am: ሁሉንም የማይካተቱትን ሰርዝ

source: Remove checklist
am: የማረጋገጫ ዝርዝር አስወግድ

source: Removed %1$s
am: %1$s ተወግዷል

source: Remove from shortcuts
am: ከአቋራጭ ላይ አስወድግ

source: Removes history (including history synced from other devices)
am: ታሪክን ያስወግዳል (ከሌሎች መሳሪያዎች ጋር የተመሳሰለ ታሪክን ጨምሮ)

source: Removes history (including history synced from other devices), cookies and other browsing data.
am: ታሪክን (ከሌሎች መሳሪያዎች ጋር የሰመረ ታሪክን ጨምሮ)፣ ኩኪዎችን እና ሌላ የአሰሳ ውሂብን ያስወግዳል።

source: Remove tab from collection
am: ትርን ከስብስብ ያስወግዱ

source: Removing cookies and site data for <b>%s</b> might log you out of websites and clear shopping carts.
am: ለ<b>%s</b> ኩኪዎችን እና የጣቢያ ውሂብን ማስወገድ ከድር ጣቢያዎች ሊያወጣዎት እና የግዢ ጋሪዎችን ሊያጸዳ ይችላል።

source: Removing files from your download manager also removes them from your device
am: ፋይሎችን ከአውርድ አስተዳዳሪዎ ማስወገድ እንዲሁ ከመሣሪያዎ ያስወግዳቸዋል

source: Rename
am: እንደገና ይሰይሙ

source: Rename collection
am: ስብስቡን እንደገና ይሰይሙ

source: Replace query with “%s”. Example: https://suggestqueries.google.com/complete/search?client=firefox&q=%s
am: መጠይቁን በ “%s” ይተኩ። ምሳሌ፡- https://suggestqueries.google.com/complete/search?client=firefox&q=%s

source: Replace query with “%s”. Example: http://suggestqueries.google.com/complete/search?client=firefox&q=%s
am: መጠይቁን በ “%s” ይተኩ። ምሳሌ፡- http://suggestqueries.google.com/complete/search?client=firefox&q=%s

source: Replace query with “%s”. Example: https://www.google.com/search?q=%s
am: ጥያቄውን በ "%s" ይተኩ። ምሳሌ፡- https://www.google.com/search?q=%s

source: Report broken site
am: የተበላሽ ጣቢያ አሳውቅ

source: Report broken site…
am: የተበላሽ ጣቢያ አሳውቅ…

source: Report product is in stock
am: ምርት በክምችት መኖሩን አመልክት

source: Report this product is back in stock
am: ይህ ምርት ወደ ክምችት መመለሱን ሪፖርት ያድርጉ

source: Request sent
am: ጥያቄው ተልኳል

source: Request support
am: ድጋፍ ይጠይቁ

source: Request support for this site?
am: ለዚህ ጣቢያ ድጋፍ ይጠይቁ?

source: Request to support site submitted
am: የድረ-ገጽ ድጋፍ ጥያቄ ገብቷል

source: Request to support site submitted.
am: የድረ-ገጽ ድጋፍ ጥያቄ ገብቷል።

source: required
am: ያስፈልጋል

source: Required
am: ያስፈልጋል

source: Required data collection:
am: አስፈላጊ መረጃ መሰብሰብ፡-

source: Required permissions:
am: አስፈላጊ ፈቃዶች፡-

source: Resend data
am: ውሂብ እንደገና ላክ

source: Resend data to this site?
am: ውሂብ ወደዚህ ድረ-ገፅ እንደገና ይላክ?

source: Reset CFRs
am: CFRዎችን ዳግም ያስጀምሩ

source: Restart %1$s
am: %1$sን እንደገና ያስጀምሩ

source: Restart add-ons
am: ተጨማሪዎችን እንደገና ያስጀምሩ

source: Restart extensions
am: ቅጥያዎችን እንደገና ያስጀምሩ

source: Restore tab
am: ትርን ወደነበረበት መልስ

source: Resume
am: ካቆመበት ቀጥል

source: Resync
am: ዳግም አስምር

source: Retro 2004
am: ሬትሮ 2004

source: Retry
am: እንደገና ይሞክሩ

source: RETRY
am: እንደገና ሞክር

source: Return to previous app
am: ወደ ቀዳሚው መተግበሪያ ተመለስ

source: Review checker
am: የግምገማ አረጋጋጭ

source: Review Checker
am: የግምገማ አረጋጋጭ

source: Review checker is powered by %s
am: የግምገማ አረጋጋጭ የተጎላበተው በ%s ነው

source: Review checker is powered by %s.
am: የግምገማ አረጋጋጭ የተጎላበተው በ%s ነው።

source: Reviews: %1$s
am: ግምገማዎች፡- %1$s

source: Run in private browsing
am: በግል አሰሳ ውስጥ አሂድ

source: Safe browsing with more choices
am: ከተጨማሪ ምርጫዎች ጋር ደህንነቱ የተጠበቀ አሰሳ

source: Sans serif
am: ሳንሰ ሰሪፍ

source: Sans Serif font
am: ሳንሰ ሰሪፍ ቅርጸ-ቁምፊ

source: Satisfied
am: ረክቻለሁ

source: Save address
am: አድራሻ አስቀምጥ

source: Save and autofill addresses
am: አድራሻዎችን ያስቀምጡ እና በራስ-ሙላ

source: Save and autofill cards
am: ካርዶችን ያስቀምጡ እና በራስ-ሙላ

source: Save and continue
am: አስቀምጥ እና ቀጥል

source: Save and fill addresses
am: አድራሻዎችን ያስቀምጡ እና በራስ-ሰር ይሙሉ

source: Save and fill payment methods
am: የመክፈያ ዘዴዎችን ያስቀምጡ እና ይሙሉ

source: Save and start browsing
am: ያስቀምጡ እና ማሰስ ይጀምሩ

source: Save as PDF
am: እንደ PDF አስቀምጥ

source: Save as PDF…
am: እንደ ፒዲኤፍ አስቀምጥ…

source: Save changes.
am: ለውጦችን አስቀምጥ።

source: Save changes to login.
am: መግቢያው ላይ የተደረገውን ለውጥ አስቀምጥ።

source: Saved cards
am: የተቀመጡ ካርዶች

source: Saved in “%s”
am: በ“%s” ውስጥ ተቀምጧል

source: Saved logins
am: የተቀመጡ መግቢያዎች

source: Saved passwords
am: የተቀመጡ የይለፍ ቃላት

source: Saved %s
am: %s ተቀምጧል

source: Save file to device
am: ፋይሉን ወደ መሳሪያ አስቀምጥ

source: Save image
am: ምስል አስቀምጥ

source: Save in
am: ውስጥ አስቀምጥ

source: Save logins and passwords
am: መግቢያዎችን እና የይለፍ ቃሎችን ያስቀምጡ

source: Save new login
am: አዲስ መግቢያን አስቀምጥ

source: Save password?
am: የይለፍ ቃል ይቀመጥ?

source: Save passwords
am: የይለፍ ቃሎችን አስቀምጥ

source: Save selected tabs to collection
am: የተመረጡ ትሮችን ወደ ስብስብ ያስቀምጡ

source: Save sites as you browse. Sign in to grab bookmarks from other synced devices.
am: ሲያስሱ ጣቢያዎችን ያስቀምጡ። ከሌሎች የተመሳሰሉ መሳሪያዎች ዕልባቶችን ለመውሰድ ይግቡ።

source: Save sites as you browse. We’ll also grab bookmarks from other synced devices.
am: ሲያስሱ ጣቢያዎችን ያስቀምጡ። ከሌሎች የተመሳሰሉ መሳሪያዎች ዕልባቶችን እንይዛለን።

source: Save some battery and your eyesight with dark mode.
am: በጨለማ ሁነታ የተወሰነ ባትሪ እና እይታዎን ይቆጥቡ።

source: Save tabs to collection
am: ትሮችን ወደ ስብስብ አስቀምጥ

source: Save this login?
am: ይህ መግቢያ ይቀመጥ?

source: Save to collection
am: ወደ ስብስብ አስቀምጥ

source: Save to collection…
am: ወደ ስብስብ አስቀምጥ…

source: %s by Mozilla
am: %s በሞዚላ

source: Scan
am: ቃኝ

source: Scan QR code
am: የQR ኮድ ይቃኙ

source: Scan the code
am: ኮዱን ይቃኙ

source: Scan the QR code shown at <b>firefox.com/pair</b>
am: በ<b>firefox.com/pair</b> ላይ የሚታየውን የQR ኮድ ይቃኙ

source: Scroll to hide address bar and toolbar
am: የአድራሻ አሞሌን እና የመሳሪያ አሞሌን ለመደበቅ ያሸብልሉ

source: Scroll to hide toolbar
am: የመሳሪያ አሞሌን ለመደበቅ ያሸብልሉ

source: Search %1$s
am: %1$s ፈልግ

source: Search bookmarks
am: እልባቶችን ፈልግ

source: Search browsing history
am: የአሰሳ ታሪክን ፈልግ

source: Search by Image
am: በምስል ይፈልጉ

source: Search directly from the address bar
am: በቀጥታ ከአድራሻ አሞሌው ይፈልጉ

source: Search downloads
am: ውርዶችን ይፈልጉ

source: Search engine
am: የፍለጋ ፍርግም

source: Search engine name
am: የፍለጋ ፍርግም ስም

source: Search engines
am: የፍለጋ ፍርግሞች

source: Search engine: %s
am: የፍለጋ ፍርግም፦ %s

source: Search engine settings
am: የፍለጋ ፍርግም ቅንብሮች

source: Search history
am: የፍለጋ ታሪክ

source: Search language
am: ቋንቋ ይፈልጉ

source: Search logins
am: መግቢያዎችን ፈልግ

source: Search or enter address
am: አድራሻ ይፈልጉ ወይም ያስገቡ

source: Search passwords
am: የይለፍ ቃላትን ፈልግ

source: Search %s
am: በ%1$s ፈልግ

source: Search settings
am: የፍለጋ ቅንብሮች

source: Search string to use
am: ለፍለጋ የሚጠቀሙት ሕብረቁምፊ

source: Search string URL
am: የፍለጋ ሕብረ-ቁምፊ URL

source: Search suggestion API (optional)
am: የፍለጋ ጥቆማ API (አማራጭ)

source: Search suggestion API URL
am: የፍለጋ ጥቆማ API URL

source: Search synced tabs
am: የተመሳሰሉ ትሮችን ፈልግ

source: Search tabs
am: ትሮችን ፈልግ

source: search terms
am: የፍለጋ ቃላት

source: Search the web
am: ድሩን ይፈልጉ

source: Secure
am: ደህንነቱ የተጠበቀ

source: Secure connection
am: ደህንነቱ የተጠበቀ ግንኙነት

source: Secure Connection Failed
am: ደህንነቱ የተጠበቀ ግንኙነት አልተሳካም

source: Securely save this card?
am: ይህን ካርድ ደህንነቱ በተጠበቀ ሁኔታ ይቀመጥ?

source: Securely send tabs between your devices and discover other privacy features in Firefox.
am: በመሳሪያዎችዎ መካከል ደህንነቱ በተጠበቀ ሁኔታ ትሮችን ይላኩ እና በFirefox ውስጥ ሌሎች የግላዊነት ባህሪያትን ያግኙ።

source: Secure site not available
am: ደህንነቱ የተጠበቀ ድረ-ገፅ የለም

source: Secure Site Not Available
am: ደህንነቱ የተጠበቀ ድረ-ገፅ የለም

source: Secure your credit cards
am: የክሬዲት ካርዶችዎን ደህንነት ይጠብቁ

source: Secure your logins and passwords
am: የእርስዎን መግቢያዎች እና የይለፍ ቃላት ደህንነት ይጠብቁ

source: Secure your saved passwords
am: የተቀመጡ የይለፍ ቃላትዎን ደህንነት ይጠብቁ

source: Secure your saved payment methods
am: የተቀመጡ የመክፈያ ዘዴዎችዎን ደህንነት ይጠብቁ

source: See all synced tabs
am: ሁሉንም የተመሳሰሉ ትሮችን ይመልከቱ

source: See an interesting pic and learn more about it.
am: አንድ አስደሳች ፎቶ ይመልከቱ እና ስለሱ የበለጠ ይረዱ።

source: See details
am: ዝርዝሮችን ይመልከቱ

source: See fewer cookie pop-ups
am: ያነሱ የኩኪ ብቅ-ባዮችን ይመልከቱ

source: See how reliable product reviews are on %1$s before you buy. Review Checker, an experimental feature from %2$s, is built right into the browser.
am: ከመግዛትዎ በፊት በ%1$s ላይ የምርት ግምገማዎች ምን ያህል አስተማማኝ እንደሆኑ ይመልከቱ። የ%2$s የሙከራ ባህሪ የግምገማ አረጋጋጭ በቀጥታ በአሳሹ ውስጥ ነው የተሰራው።

source: See how reliable product reviews are on %1$s before you buy. Review checker, an experimental feature from %2$s, is built right into the browser. It works on %3$s and %4$s, too.
am: ከመግዛትዎ በፊት በ%1$s ላይ የምርት ግምገማዎች ምን ያህል አስተማማኝ እንደሆኑ ይመልከቱ። የግምገማ አረጋጋጭ፣ ከ%2$s የመጣ የሙከራ ባህሪ፣ ልክ በአሳሹ ውስጥ ነው የተሰራው። በ%3$s እና %4$s ላይም ይሰራል።

source: See the web in the best light.
am: ድሩን በጥሩ ብርሃን ይመልከቱ።

source: select
am: ይምረጡ

source: Select address
am: አድራሻ ይምረጡ

source: Select addresses
am: አድራሻዎችን ይምረጡ

source: Select a language to manage ”always translate“ and ”never translate“ preferences.
am: ”ሁልጊዜ መተርጎም“ እና ”ፍፁም አትተረጎም“ ምርጫዎችን ለማስተዳደር ቋንቋ ምረጥ።

source: Select all
am: ሁሉንም ይምረጡ

source: Select a theme
am: ገጽታ ይምረጡ

source: Select collection
am: ስብስብ ይምረጡ

source: Select credit card
am: ክሬዲት ካርድ ይምረጡ

source: Selected language
am: የተመረጠ ቋንቋ

source: Selected tabs menu
am: የተመረጡ የትሮች ምናሌ

source: Select folder
am: አቃፊ ይምረጡ

source: Select one
am: አንዱን ይምረጡ

source: Select tabs
am: ትሮችን ይምረጡ

source: Select Tabs
am: ትሮችን ይምረጡ

source: Select tabs to save
am: ለማስቀመጥ ትሮችን ይምረጡ

source: %s encrypts all payment methods you save
am: %s ያስቀመጧቸውን ሁሉንም የመክፈያ ዘዴዎች ያመሰጥራቸዋል

source: %s encrypts your card number. Your security code won’t be saved.
am: %s የካርድ ቁጥርዎን ያመስጥራል። የደህንነት ኮድዎ አይቀመጥም።

source: Send automatically
am: በራስ ሰር ላክ

source: Send crash report
am: የብልሽት ሪፖርት ላክ

source: Send crash report to %1$s
am: የብልሽት ሪፖርት ወደ %1$s ላክ

source: Send crash report to Mozilla
am: የብልሽት ሪፖርት ወደ ሞዚላ ይላኩ

source: Sending crash report to %1$s
am: የብልሽት ሪፖርት ወደ %1$s በመላክ ላይ

source: Send more info
am: ተጨማሪ መረጃ ላክ

source: Send request
am: ጥያቄ ላክ

source: Send tabs between devices, manage downloads, and get tips on getting the most out of Firefox.
am: በመሳሪያዎች መካከል ትሮችን ይላኩ፣ ውርዶችን ያስተዳድሩ እና ከፋየርፎክስ የበለጠ ለመጠቀም ምክሮችን ያግኙ።
